import type { NewQuestionModalValues } from '@/types/exam-variant'

export const MOCK_DATA: NewQuestionModalValues = {
  data: [
    {
      questionNewId: 2,
      category: 'GEO',
      type: 'MCQ',
      passage:
        '1 + 1을 구하시오.1 + 1을 구하시1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오. + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오. + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오. + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오. + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오. + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오. + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오. + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.1 + 1을 구하시오.',

      options: [
        {
          order: 1,
          text: '-1',
        },
        {
          order: 2,
          text: '0',
        },
        {
          order: 3,
          text: '2',
        },
        {
          order: 4,
          text: '-2',
        },
        {
          order: 5,
          text: '10',
        },
      ],
      answer: 3,
      analysis:
        '1+1은 2입니다.1+1은 2입니다.1+1은 2입니다.1+1은 2입니다.1+1은 2입니다.1+1은 2입니다.1+1은 2입니다.1+1은 2입니다.1+1은 2입니다.',
    },
    {
      questionNewId: 2,
      category: 'GEO',
      type: 'FRQ',
      passage: '1 + 1을 구하시오.',

      options: null,
      answer: 2,
      analysis:
        '1+1은 2입니다.1+1은 2입니다.1+1은 2입니다.1+1은 2입니다.1+1은 2입니다.1+1은 2입니다.1+1은 2입니다.1+1은 2입니다.1+1은 2입니다.',
    },
  ],
}
